# -*- coding: utf-8 -*-


from pythainlp.tokenize import word_tokenize
from pythainlp.corpus import stopwords
#from pythainlp.spell.pn import correction
from pythainlp.spell import *


###### Word segmentation #######
text = 'จบไปแล้วใครยังฟินค้างอยู่ไลค์รัวๆกันได้เลยกับ11หนุ่มน้อยวัยฮอร์โมนพุ่งวงWannaOne'
#text = 'ตายโดยแสงแดดรอพอใจขั้นเทพ'
#text = "จบไปแล้วใครยังฟินค้างอยู่ ไลค์รัวๆ กันได้เลย กับ 11 หนุ่มน้อยวัยฮอร์โมนพุ่งวง วอนนาวัน Wanna One กับการมาโชว์ที่ไทยเป็นครั้งแรกในงาน วอนนาวัน เฟิร์ส แฟน มีตติ้ง อิน แบงคอก : วอนนา บี เลิฟ WANNA ONE 1 st Fan Meeting in Bangkok : WANNA Be LovEd จัดไปแล้วที่ ไบเทคบางนา ฮอลล์ 106 แฟนคลับเกาหลีได้ฟินจังเพราะ กึ้ง เฉลิมชัย แห่งบริษัท โฟร์ วัน วัน เอ็นเตอร์เทนเม้นท์ นำมาให้ดูถึงไทยกันเลย"
#text='วันนี้7 กย นายประดับ โพธิกาญจนวัตร โฆษกสำนักงานพระพุทธศาสนาแห่งชาติพศ เปิดเผยว่า พศได้รับเรื่องร้องเรียนจากประชาชน และองค์กรเครือข่ายชาวพุทธ เกี่ยวกับเนื้อหาของเกมไฟว์ออฟก๊อด Fight of Godsဌ โดยมีวางจำหน่ายในระบบขายเกมออนไลน์ชื่อดังหลายเว็บไซต์ ซึ่งเกมดังกล่าวมีเนื้อหาที่เกี่ยวกับ ศาสนา ที่หยิบยกศาสดาของแต่ละศาสนา และเหล่าทวยเทพมาต่อสู้กัน เช่น พระพุทธเจ้าต่อสู้กับพระเยซู เป็นต้น พร้อมโฆษณาด้วยถ้อยคำว่า พระพุทธองค์ ปะทะ พระเยซู แมทช์หยุดโลกหยุดจักรวาลกันเลย ดังนั้น ทางภาคประชาชน องค์กร เครือข่ายชาวพุทธจึงเห็นว่า ไม่เหมาะสม ที่จะนำความเชื่อทางศาสนามาทำเกม ที่สำคัญยังนำศาสดาของแต่ละศาสนามาต่อสู้กัน เป็นการดูหมิ่นศาสดา และอาจจะสร้างความรู้สึกแตกแยกทางศาสนาเพิ่มมากขึ้น รวมทั้งกระทบต่อความรู้สึกต่อผู้ที่ศรัทธาต่อพระพุทธศาสนา และศาสนาอื่นๆด้วยนายประดับ กล่าวต่อไปว่า พศจะประสานข้อมูลดังกล่าวไปยังกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม กระทรวงการต่างประเทศ กระทรวงวัฒนธรรม เนื่องจากพศได้ตรวจสอบข้อมูลเบื้องต้น พบว่า ผู้ผลิตเกมดังกล่าวอยู่ในต่างประเทศ แต่เมื่อเว็บไซต์ในประเทศไทยได้นำมานำเสนอ ก็จะขอให้หน่วยงานที่เกี่ยวข้องช่วยประสานและทำความเข้าใจที่อาจจะก่อให้เกิดความขัดแยังทางศาสนา หรือกระทบต่อความรู้สึกของผู้นับถือศาสนาได้ด้านสมาพันธ์เครือข่ายชาวพุทธแห่งประเทศไทย ได้ออกแถลงการณ์ประณามผู้สร้างและผู้จัดจำหน่ายเกมFight of Godsဌ ความว่า เนื่องจากสมาพันธ์ชาวพุทธแห่งประเทศไทย ได้รับข้อมูลของเว็บไซต์แห่งหนึ่ง ได้ลงโฆษณาจัดจำหน่ายเกมFight of Godsဌซึ่งพัฒนาโดย Digital Crafter จากประเทศจีน และได้มีการนำมาโฆษณาจัดจำหน่ายในประเทศไทย ในเกมดังกล่าว มีการนำเอาพระพุทธเจ้า พระเยซู เทพโอดิน เทพีเอเธน่า เทพีอามาเทราสุ โมเสส เทพีซิฟ เทพเจ้ากวนอู อานูบิส เทพซุส มาเป็นตัวละครต่อสู้กัน ศาสนาทุกศาสนาล้วนให้ความเคารพสักการะศาสดา และพระเจ้าของตนเองอย่างสูงสุด การนำเอาพระศาสดา มาทำเป็นเกมเพื่อหาผลประโยชน์เช่นนี้ นับได้ว่าเป็นความเลวร้าย ความเห็นแก่ตัวของผู้ผลิตรวมถึงผู้จัดจำหน่ายในประเทศไทยในปัจจุบัน มีกฎหมายที่ปกป้องคุ้มครองศาสนา คือ กฏหมายรัฐธรรมนูญมาตรา 67 และกฏหมายอาญามาตรา 206 โดยเฉพาะกฏหมายอาญามาตรา 206 ผู้ใดกระทำด้วยประการใดๆ แก่วัตถุ หรือสถานอันเป็นที่เคารพในทางศาสนา ของหมู่ชนใด อันเป็นการเหยียดหยาม ศาสนานั้น ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงเจ็ดปี หรือปรับตั้งแต่สองพันบาทถึงหนึ่งหมื่นสี่พันบาทหรือทั้งจำทั้งปรับ เบื้องต้นขอให้เว็บไซต์ยกเลิกการจัดจำหน่าย และหยุดโฆษณา พร้อมออกประกาศขอโทษศาสนาต่างๆที่ได้นำเอาศาสนามาแสวงหาประโยชน์ สำหรับประเทศไทย หากยังไม่หยุดการจัดจำหน่าย รวมถึงการโฆษณา ทางสมาพันธ์ชาวพุทธฯ จะพิจารณาร่วมกับองค์กรชาวพุทธอื่นๆ รวมถึงองค์กรศาสนาคริสต์ เพื่อใช้กฏหมายดำเนินการเอาผิดต่อไป ในส่วนของผู้ผลิตนั้น สมาพันธ์ชาวพุทธฯ จะพิจารณาดำเนินการยื่นหนังสือผ่านสถานทูตหรือให้องค์กรพุทธอื่นๆในประเทศจีนดำเนินการประท้วงต่อไป'
#text=' ทีม WARR Hyperloop จากมหาวิทยาลัยเทคโนโลยีแห่งมิวนิก (Technical University of Munich หรือ TUM) สร้างไฮเปอร์ลูปที่ทำความเร็วได้สูงสุดถึง 290 ไมล์/ชั่วโมง (467 กิโลเมตร/ชั่วโมง) ในระหว่างการแข่งขันพัฒนาไฮเปอร์ลูปครั้งที่ 3 ของอีลอน มัสก์  โดยกระสวยคาร์บอนไฟเบอร์ น้ำหนัก 154 ปอนด์ (70 กิโลกรัม) ซึ่งประกอบไปด้วยพาวเวอร์เซมิคอนดักเตอร์จำนวน 144 ชิ้นจาก Infineon Technologies นี้  สามารถทำความเร็วได้มากกว่าทีมที่ได้รับรางวัลรองชนะเลิศ (88 ไมล์/ชั่วโมง) ถึงสามเท่า'
#text='ผมรักคุณนะครับโอเคบ่พวกเราเป็นคนไทยรักภาษาไทยภาษาบ้านเกิด'
#text='เป็นอีกโปรเจคท์ที่หลายคนรอคอย สำหรับ แทยงXเตนล์ ที่ เอสเอ็ม สานฝันให้แฟน ๆ ได้ฟินสมใจ ด้วยการนำ เตนล์ชิตพล ลี้ชัยพรกุล หนุ่มคิวท์บอย สายเลือดไทย มารวมตัวกับหนุ่มหล่อเข้มเกาหลี อย่าง แทยง เป็นดูโอ้คู่แรกของ เอ็นซีที ยู จากโปรเจคท์ เอ็นซีที ทูเธาซันด์เอธทีน ในเพลง เบบี้ ด้อนท์ สต๊อป เพลงแนวซินธ์ ป๊อป พร้อมซาวด์มินิมอลและเสียงกลองที่ติดหูเพียงฟังครั้งแรก เนื้อเพลงพูดถึงความรู้สึกดึงดูดของความรัก ที่อยากจะเข้าไปรู้จักแบบไม่มีที่สิ้นสุดและหยุดไม่ได้ โดย แทยง ยังได้มีส่วนร่วมในการแต่งท่อนแร็พเพลงนี้ด้วย ซึ่งทั้ง 2 หนุ่มโชว์ภาพลักษณ์อันทรงพลัง ด้วยเสน่ห์ที่เข้ากันลงตัว การคอนทราสต์ระหว่างเสียงลุ่มลึกของ แทยง และเสียงนุ่มละมุนของ เตนล์ ทำให้กลายเป็นเพลงที่มีความซับซ้อน แต่กลมกล่อมด้วยเสียงซินธ์ที่เซ็กซี่การแร็พที่น่าทึ่ง และเสียงกระซิบอันน่าหลงใหล พิสูจน์ถึงความสามารถของทั้งคู่ ส่วนมิวสิกวิดีโอเพลงนี้ก็โชว์เคมีสุดเพอร์เฟกต์ของ 2 หนุ่มผ่านการเต้นที่แข็งแกร่ง ภาพลักษณ์อันร้อนแรง ในสไตล์ฮิปฮอปสุดเซ็กซี่ ซึ่งในเวลา 3 นาทีของมิวสิกวิดีโอก็สะกดทุกคนอยู่หมัด เช่นเดียวกับโชว์ที่ทั้งคู่ทำได้อย่างสมบูรณ์แบบ ซึ่ง เอ็ม เคานท์ดาวน์ ได้ทวีตชื่นชมว่า เคมี ที่เพอร์เฟกต์ทั้งภาพลักษณ์และการแสดง ขณะที่เว็บดัง บิลบอร์ด ยกย่องว่า ทั้งคู่ได้โชว์การแสดงที่คล่องแคล่วเปี่ยมด้วยพลังผ่านมิวสิกวิดีโอ โดยเน้นความสำคัญไปที่พรสวรรค์ทั้งคู่ในฐานะนักเต้นหลักของวง โดยหลังปล่อยเพลงนี้ได้ไม่นาน ก็ได้รับเสียงตอบรับที่ดีมาก โดยมิวสิกวิดีโอมียอดคนเข้าชมในยูทูบเกิน 2 ล้านครั้งใน 24 ชั่วโมง และตอนนี้ก็มียอดวิวเกินกว่า 5 ล้านวิวแล้ว และหนุ่ม ๆ ได้ขอบคุณแฟน ๆ ผ่านทวิตเตอร์เอ็นซีทีว่า ยอดวิวเอ็มวี เบบี้ ด้อนท์ สต๊อป เกิน 5 ล้านครั้งแล้ว ขอบคุณจากใจจริงครับ ซึ้งใจมากที่มีคนดูกันเยอะ ต้องขอบคุณ เอ็นซีทีเซน ชื่อแฟนคลับ ของพวกเรา จะขยันทำงาน ให้มากขึ้นครับทั้งนี้ เอ็นซีที ทูเธาซันด์เอธทีน ถือเป็นโปรเจคท์สุดยิ่งใหญ่ของ เอ็นซีที ที่รวมสมาชิกทั้ง 18 คน มาทำกิจกรรมในปี 2018 โดยมีแผนการปล่อยอัลบั้มเต็มในวันที่ 14 มีค พร้อม 6 มิวสิกวิดีโอ ซึ่งทุกคนจะได้พบกับเสน่ห์และรูปแบบที่หลากหลายทุกยูนิตของเอ็นซีทีภายในอัลบั้มเดียวกัน งานนี้แฟนคลับชาวไทย ติดตามข่าวของหนุ่ม ๆ ได้ทาง เฟซบุ๊ก SmtrueThailand                                                                  5'
a=word_tokenize(text,engine='icu') # ['ผม', 'รัก', 'คุณ', 'นะ', 'ครับ', 'โอ', 'เค', 'บ่', 'พวก', 'เรา', 'เป็น', 'คน', 'ไทย', 'รัก', 'ภาษา', 'ไทย', 'ภาษา', 'บ้าน', 'เกิด']
b=word_tokenize(text,engine='dict') # ['ผม', 'รัก', 'คุณ', 'นะ', 'ครับ', 'โอเค', 'บ่', 'พวกเรา', 'เป็น', 'คนไทย', 'รัก', 'ภาษาไทย', 'ภาษา', 'บ้านเกิด']
c=word_tokenize(text,engine='mm') # ['ผม', 'รัก', 'คุณ', 'นะ', 'ครับ', 'โอเค', 'บ่', 'พวกเรา', 'เป็น', 'คนไทย', 'รัก', 'ภาษาไทย', 'ภาษา', 'บ้านเกิด']
#d=word_tokenize(text,engine='pylexto') # ['ผม', 'รัก', 'คุณ', 'นะ', 'ครับ', 'โอเค', 'บ่', 'พวกเรา', 'เป็น', 'คนไทย', 'รัก', 'ภาษาไทย', 'ภาษา', 'บ้านเกิด']
e=word_tokenize(text,engine='newmm') # ['ผม', 'รัก', 'คุณ', 'นะ', 'ครับ', 'โอเค', 'บ่', 'พวกเรา', 'เป็น', 'คนไทย', 'รัก', 'ภาษาไทย', 'ภาษา', 'บ้านเกิด']
g=word_tokenize(text,engine='deepcut') # ['ผม', 'รัก', 'คุณ', 'นะ', 'ครับ', 'โอเค', 'บ่', 'พวกเรา', 'เป็น', 'คน', 'ไทย', 'รัก', 'ภาษา', 'ไทย', 'ภาษา', 'บ้านเกิด']
#words = stopwords.words('thai')
#print(words)
print ("icu = ", a)
print ("dict = ", b)
print ("mm = ", c)
print ("newmm = ", e)
print ("deepcut = ", g)




##### Check spell #####
#h=correction("วอนนาวัน")
#k=spell("โล")
#print(k) # ['สี่เหลี่ยม']




##### SQL ######
'''
select @n:=@n+1 as 'No.',url from url_sports_siamrath,(select @n:=-1) as m
#select @n:=@n+1 as 'No.',website,url,title,body from article,(select @n:=-1) as m where genre in ('\'entertainment\'') AND website IN ('\'dailynews\'')
#select @n:=@n+1 as 'No.',website,url,title,body from article,(select @n:=-1) as m where genre in ('\'entertainment\'')
#select @n:=@n+1 as 'No.',url,title,body from article,(select @n:=-1) as m where genre in ('\'entertainment\'');
#SELECT @n:=@n+1 as 'No.',body FROM article, (SELECT @n:=-1) as m where genre in ('\'entertainment\'') INTO OUTFILE '/Users/USER/AnacondaProject/Dailynews/entertainment.csv' FIELDS TERMINATED BY ',' ENCLOSED BY '"' LINES TERMINATED BY '\n';
#CREATE TABLE article_entertainment(url VARCHAR(200) NOT NULL, title VARCHAR(200) NOT NULL, genre VARCHAR(50) NOT NULL, body VARCHAR(10000) NOT NULL, time VARCHAR(50) NOT NULL, PRIMARY KEY(url));
#SELECT @n:=@n+1 as 'No.',body FROM article, (SELECT @n:=-1) as m where genre in ('\'entertainment\'') INTO OUTFILE '/Users/USER/Anaconda/Anacondaprojects/Automatic_Labeling_ThaiNewsArticles_by_Fasttext/entertainment.csv' FIELDS TERMINATED BY ',' ENCLOSED BY '"' LINES TERMINATED BY '\n' '''




###### Test Fasttext ######
'''from fastText import load_model
from itertools import chain
from collections import Counter
from numpy.linalg import eig

thai_model = load_model('/wiki.th/wiki.th.bin')
word_appearance = Counter(chain.from_iterable(df.tokenized_text_clean))
word_df = pd.DataFrame(list(word_appearance.items()), columns=['word', 'occurence'])
word_df['p_occurence']  = word_df.occurence / word_df.occurence.sum()
p_dict = {r['word']: r['p_occurence'] for _, r in word_df.iterrows()}

def get_sentence_vector(ls, a=10e-4):
    """Average word vector for given list of words using fastText

    ref: A Simple but Tough-to-Beat Baseline for Sentence Embeddings, ICLR 2017
    https://openreview.net/pdf?id=SyK00v5xx
    """
    wvs = []
    for w in ls:
        wv = thai_model.get_word_vector(w)
        if w is not None:
            wvs.append([wv, p_dict[w]])
    wvs = np.array(wvs)
    return np.mean(wvs[:, 0] * (a / (a + wvs[:, 1])), axis=0)

X = np.vstack(df.tokenized_text.map(get_sentence_vector))
eig_val, eig_vec = eig(X.T.dot(X))
u = eig_vec[:, 0].reshape(-1, 1).T
X_sent = np.vstack([x - u.T.dot(u).dot(x) for x in X])
y = pd.get_dummies(df.news_type).as_matrix()'''